In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.4.0-cp311-cp311-macosx_13_0_arm64.whl.metadata (1.9 kB)
Downloading mysql_connector_python-8.4.0-cp311-cp311-macosx_13_0_arm64.whl (13.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.5/13.5 MB 583.2 kB/s eta 0:00:0000:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.4.0

In [11]:
#CREATING DATABASE

import mysql.connector

database = mysql.connector.connect(
  host="localhost",
  user="root",
  password=""
)

mycursor = database.cursor()

mycursor.execute("CREATE DATABASE Database1")

In [1]:
#CONNECTING DATABASE

import mysql.connector

database = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
    database = "python_class"
)

db = database.cursor()

In [26]:
db.execute("SELECT * FROM student")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 40, 50, 60, 70, 30, 410, 60.0, 'B')
(2, 'Hari', 10, 20, 30, 40, 50, 150, 30.0, 'F')
(3, 'Shyam', 40, 40, 40, 40, 40, 200, 40.0, 'C')
(4, 'Jones', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(5, 'Ramesh', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(6, 'Sammy', 60, 60, 60, 60, 60, 300, 60.0, 'B')

In [15]:
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES (NULL, 'Ramesh', '40', '50', '40', '50', '40', '250', '45', 'B');'''
db.execute(sql)
database.commit() #need to commit or else database won't be updated
print(db.rowcount,"record inserted.")

1 record inserted.

In [28]:
name = input("Enter name: ")
a = int(input("physics: "))
b = int(input("chemsitry: "))
c = int(input("math: "))
d = int(input("english: "))
e = int(input("nepali: "))
total= a+b+c+d+e
per=total/5
    
if per>=80:
    grade = "A"
elif per>=60:
    grade = "B"
elif per>=40:
    grade = "C"
else:
    grade = "D"

#inserting data into table
sql = f'''INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('{name}',{a},{b},{c},{d},{e},{total},{per},'{grade}')'''
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted.")

Enter name: dsfs
physics: 234
chemsitry: 234
math: 234
english: 24
nepali: 24
1 record inserted.

In [29]:
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES (NULL, 'Rammy', 40, 50, 40, 50, 40, 250, 45, 'C');'''
db.execute(sql)
database.commit() #need to commit or else database won't be updated
print(db.rowcount,"record inserted.")

1 record inserted.

In [8]:
#Update in mysql
sql = 'UPDATE student SET name = "Rama" WHERE sn=1' #cannot use same '' inside variable Rama
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) updated")

1 record(s) updated

In [9]:
#Delete in sql
sql = 'DELETE FROM student WHERE sn=8' 
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) deleted")

1 record(s) deleted

In [12]:
#SELECTING with conditions
db.execute("SELECT * FROM student WHERE grade = 'B'")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 40, 50, 60, 70, 30, 410, 60.0, 'B')
(4, 'Jones', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(5, 'Ramesh', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(6, 'Sammy', 60, 60, 60, 60, 60, 300, 60.0, 'B')

In [14]:
#SELECTING with conditions
db.execute("SELECT * FROM student WHERE physics < 50")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 40, 50, 60, 70, 30, 410, 60.0, 'B')
(2, 'Hari', 10, 20, 30, 40, 50, 150, 30.0, 'F')
(3, 'Shyam', 40, 40, 40, 40, 40, 200, 40.0, 'C')
(4, 'Jones', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(5, 'Ramesh', 40, 50, 40, 50, 40, 250, 45.0, 'B')

In [26]:
db.execute("SELECT * FROM student WHERE name like '%s%'")
result = db.fetchall()
for x in result:
    print(x)

(3, 'Shyam', 40, 40, 40, 40, 40, 200, 40.0, 'C')
(4, 'Jones', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(5, 'Ramesh', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(6, 'Sammy', 60, 60, 60, 60, 60, 300, 60.0, 'B')
(7, 'dsfs', 234, 234, 234, 24, 24, 750, 150.0, 'A')

In [30]:
db.execute("SELECT * FROM student WHERE name like '%s'")
result = db.fetchall()
for x in result:
    print(x)

(4, 'Jones', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(7, 'dsfs', 234, 234, 234, 24, 24, 750, 150.0, 'A')

In [29]:
db.execute("SELECT * FROM student WHERE name like 's%'")
result = db.fetchall()
for x in result:
    print(x)

(3, 'Shyam', 40, 40, 40, 40, 40, 200, 40.0, 'C')
(6, 'Sammy', 60, 60, 60, 60, 60, 300, 60.0, 'B')

In [31]:
db.execute("SELECT name,total,per,grade FROM student")
result = db.fetchall()
for x in result:
    print(x)

('Rama', 410, 60.0, 'B')
('Hari', 150, 30.0, 'F')
('Shyam', 200, 40.0, 'C')
('Jones', 250, 45.0, 'B')
('Ramesh', 250, 45.0, 'B')
('Sammy', 300, 60.0, 'B')
('dsfs', 750, 150.0, 'A')

In [36]:
db.execute("SELECT * FROM student ORDER BY TOTAL DESC")
result = db.fetchall()
for x in result:
    print(x)

(7, 'dsfs', 234, 234, 234, 24, 24, 750, 150.0, 'A')
(1, 'Rama', 40, 50, 60, 70, 30, 410, 60.0, 'B')
(6, 'Sammy', 60, 60, 60, 60, 60, 300, 60.0, 'B')
(4, 'Jones', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(5, 'Ramesh', 40, 50, 40, 50, 40, 250, 45.0, 'B')
(3, 'Shyam', 40, 40, 40, 40, 40, 200, 40.0, 'C')
(2, 'Hari', 10, 20, 30, 40, 50, 150, 30.0, 'F')